const colorsList: string[] = []; // Временно! Позже заменить на нормальные названия!
for (let i = 1; i < 65; i++) colorsList.push(`${i}`);
const colorsListId: number[] = [];
for (let i = 0; i < colorsList.length; i++) colorsListId.push(i);

const deffects = [
  "Стандарт",
  "Корь",
  "Цыпки",
  "Крапинки",
  "Заражение",
  "Угревая сыпь",
  "Наращивание",
  "Пустулы",
  "Прыщи",
  "Лицо в угре",
  "Угорь",
  "Сыпь На Щеках",
  "Сыпь На Лице",
  "Сборщик",
  "Половое созревание",
  "Бельмо на глазу",
  "Сыпь На Подбородке ",
  "Две Грани",
  "Интимная зона",
  "Жирный",
  "Отмеченный",
  "Прыщи",
  "Прыщи повсюду",
  "Герпес",
  "Импетиго", // 25
]; // Деффекты
const deffectsId: number[] = [];
for (let i = 0; i < deffects.length; i++) deffectsId.push(i);

const beards = [
  "Стандарт",
  "Легкая Небритость",
  "Бальбо",
  "Круговая Борода",
  "Эспаньолка",
  "Подбородок",
  "Пуховый Подбородок",
  "Ремешок для подбородка",
  "Неряшливая",
  "Мушкетер",
  "Усы",
  "Подстриженная Борода",
  "Щетина",
  "Борода Тонкого Круга",
  "Подкова",
  "Карандаш и отбивные",
  "Подбородочная борода",
  "Бальбо и бакенбарды",
  "Баранья отбивная",
  "Неряшливая 2",
  "Кудрявая",
  "Кудрявая 2",
  "Колесо",
  "Фантастическая",
  "Отто",
  "Отто и незнакомец",
  "Свет Франца",
  "Хэмпстед",
  "Эмброуз",
  "Линкольнский Занавес", // 30
]; // Бороды
const beardsId: number[] = [];
for (let i = 0; i < beards.length; i++) beardsId.push(i);

const brows = [
  "Стандарт",
  "Сбалансированные",
  "Модные",
  "Клеопатра",
  "Насмешливые",
  "Женские",
  "Соблазнительные",
  "Сжатые",
  "Чола",
  "Триумфальные",
  "Беззаботные",
  "Пышные",
  "Грызун",
  "Двойные",
  "Тонкие",
  "Карандаш",
  "Мать Плюккерово",
  "Прямые и узкие",
  "Натуральные",
  "Размытые",
  "Неопрятные",
  "Гусеница",
  "Обычные",
  "Средиземные",
  "Холеные",
  "Бушели",
  "Крылатые",
  "Колючие",
  "Монобровь",
  "Крылатые 2",
  "Тройные",
  "Арочные",
  "Контур",
  "Исчезающие",
  "Одинокие", // 35
]; // Брови
const browsId: number[] = [];
for (let i = 0; i < brows.length; i++) browsId.push(i);

const older = [
  "Стандарт",
  "Гусиные лапки",
  "Первые Признаки",
  "Средний возраст",
  "Линии Беспокойства",
  "Депрессия",
  "Выдающийся",
  "Престарелый",
  "Потрепанный",
  "Морщинистый",
  "Отвисший",
  "Трудная жизнь",
  "Старинный",
  "Пенсионер",
  "Наркоман",
  "Гериатрический", // 16
]; // Старение
const olderId: number[] = [];
for (let i = 0; i < older.length; i++) olderId.push(i);

const cosmetics = [
  "Стандарт",
  "Дымчато-Черный",
  "Бронза",
  "Мягкий Серый",
  "Ретро Глэм",
  "Естественный вид",
  "Кошачий глаз",
  "Чола",
  "Вампир",
  "Голливудское очарование",
  "Жевательная резинка",
  "Водяная мечта",
  "Подколки",
  "Пурпурная страсть",
  "Дымчатый кошачий глаз",
  "Тлеющий рубин",
  "Поп-принцесса", // 17
]; // Косметика
const cosmeticsId: number[] = [];
for (let i = 0; i < cosmetics.length; i++) cosmeticsId.push(i);

const rumyan = [
  "Стандарт",
  "Полный",
  "Под углом",
  "Круглый",
  "Горизонтальный",
  "Высокий",
  "Возлюбленный",
  "Восьмидесятые",
]; // Румянец - 8
const rumyanId: number[] = [];
for (let i = 0; i < rumyan.length; i++) rumyanId.push(i);

const faceColor = [
  "Стандарт",
  "Румяные Щеки",
  "Стерневая Сыпь",
  "Приливы",
  "Загар",
  "Избитый",
  "Алкоголик",
  "Неоднородный",
  "Тотем",
  "Сосуды",
  "Раненый",
  "Бледный",
  "Призрачный", // 13
]; // Цвет лица
const faceColorId: number[] = [];
for (let i = 0; i < faceColor.length; i++) faceColorId.push(i);

const zagar = [
  "Стандарт",
  "Неравномерный",
  "Наждачная бумага",
  "Неоднородный",
  "Грубый",
  "Кожистый",
  "Текстурированный",
  "Грубый 2",
  "Неровный",
  "Мятый",
  "Потрескавшийся",
  "Песчаный", // 12
]; // Загар
const zagarId: number[] = [];
for (let i = 0; i < zagar.length; i++) zagarId.push(i);

const pomada = [
  "Стандарт",
  "Матовые",
  "Лоск",
  "Матовый 2",
  "Глянецевые",
  "Тяжелый матовый",
  "Тяжелый лоск",
  "Матовый 3",
  "Лоск 3",
  "Размазанные",
  "Гейша",
]; // Помада - 11
const pomadaId: number[] = [];
for (let i = 0; i < pomada.length; i++) pomadaId.push(i);

const vesnushki = [
  "Стандарт",
  "Ангелоподобный",
  "Повсюду",
  "Неравномерный",
  "Точки",
  "Мост",
  "Куколка",
  "Эльф",
  "Поцелуй солнца",
  "Веснушки красотки",
  "Созвездие",
  "Модные",
  "Произво",
  "Крапчатый",
  "Капли дождя",
  "Двойное погружение",
  "Односторонний",
  "Парочка",
  "Рост", // 19
]; // Веснушки
const vesnushkiId: number[] = [];
for (let i = 0; i < vesnushki.length; i++) vesnushkiId.push(i);

const hairGrud = [
  "Стандарт",
  "Естественные",
  "Полоска",
  "Дерево",
  "Волосатый",
  "Ужасный",
  "Обезьяна",
  "Ухоженная обезьяна",
  "Бикини",
  "Удар молнии",
  "Обратная Молния",
  "Сердце Любви",
  "Грудь",
  "Счастливое лицо",
  "Череп",
  "Улиточный След",
  "Слизняк и щипки",
  "Волосатые руки", // 18
]; // Волосы на груди
const hairGrudId: number[] = [];
for (let i = 0; i < hairGrud.length; i++) hairGrudId.push(i);

const eyeColor = [
  "Зеленый",
  "Изумрудный",
  "голубой",
  "Синий океан",
  "Русые",
  "Темно-коричневый",
  "Карий",
  "Темно-Серый",
  "Светло-серый",
  "Розовый",
  "Желтый",
  "Пурпурный",
  "Затемненный",
  "Градации серого",
  "Текила Санрайз",
  "Атомный",
  "Деформация",
  "ECola",
  "Космический странник",
  "Инь Ян",
  "Яблочко",
  "Ящерица",
  "Дракон",
  "Внеземные",
  "Коза",
  "Улыбка",
  "Одержимый",
  "Демон",
  "Зараженный",
  "Инопланетянин",
  "Смерть",
  "Зомби", // 32
]; // Цвет глаз
const eyeColorId: number[] = [];
for (let i = 0; i < eyeColor.length; i++) eyeColorId.push(i);

// Волосы
const hairsMale = [
  "Стандарт",
  "2",
  "3",
  "4",
  "5",
  "6",
  "7",
  "8",
  "9",
  "10",
  "11",
  "12",
  "13",
  "14",
  "15",
  "16",
  "17",
  "18",
  "19",
  "20",
  "21",
  "22",
  "24",
  "25",
  "26",
  "27",
  "28",
  "29",
  "30",
  "31",
  "32",
  "33",
  "34",
  "35",
  "36",
  "37",
  "38", // Removed 23
];
const hairsFemale = [
  "Стандарт",
  "1",
  "2",
  "3",
  "4",
  "5",
  "6",
  "7",
  "8",
  "9",
  "10",
  "11",
  "12",
  "13",
  "14",
  "15",
  "16",
  "17",
  "18",
  "19",
  "20",
  "21",
  "22",
  "23",
  "25",
  "26",
  "27",
  "28",
  "29",
  "30",
  "31",
  "32",
  "33",
  "34",
  "35",
  "36",
  "37",
  "38",
  "39", // Removed 24
];

const hairColor: string[] = []; // Временно! После заменить на нормальные названия.
for (let i = 1; i < 66; i++) hairColor.push(`${i}`);
const hairColorId: number[] = [];
for (let i = 0; i < 65; i++) hairColorId.push(i);

const hairsMaleId = [
  0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21,
  22, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 72, 73,
];
const hairsFemaleId = [
  0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21,
  22, 23, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 76, 77,
];

export const list = {
  beards,
  brows,
  hairGrud,
  older,
  deffects,
  hairsMale,
  hairsFemale,
  hairColor,
  eyeColor,
  colorsList,
  pomada,
  cosmetics,
  rumyan,
  zagar,
  vesnushki,
  beardsId,
  browsId,
  hairGrudId,
  olderId,
  deffectsId,
  hairsMaleId,
  hairsFemaleId,
  hairColorId,
  eyeColorId,
  colorsListId,
  pomadaId,
  cosmeticsId,
  rumyanId,
  zagarId,
  vesnushkiId,
  faceColor,
  faceColorId,
};
